analysis/perf-optimize3/runs/postdash_6e3b7a37/goopg_N.pgbench.txt
pgbench (18.3)
starting vacuum...end.
progress: 30.0 s, 5285.2 tps, lat 9.458 ms stddev 14.718, 0 failed
progress: 60.0 s, 11323.1 tps, lat 4.415 ms stddev 4.618, 0 failed
progress: 90.0 s, 11524.9 tps, lat 4.338 ms stddev 3.758, 0 failed
transaction type: <builtin: simple update>
scaling factor: 100
query mode: simple
number of clients: 50
number of threads: 50
maximum number of tries: 1
duration: 120 s
number of transactions actually processed: 1187777
number of failed transactions: 0 (0.000%)
latency average = 5.051 ms
latency stddev = 6.899 ms
initial connection time = 8.171 ms
tps = 9898.409996 (without initial connection time)
statement latencies in milliseconds and failures:
         0.001           0 \set aid random(1, 100000 * :scale)
         0.000           0 \set bid random(1, 1 * :scale)
         0.000           0 \set tid random(1, 10 * :scale)
         0.000           0 \set delta random(-5000, 5000)
         0.229           0 BEGIN;
         1.022           0 UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         0.265           0 SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
         0.279           0 INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
         3.263           0 END;